import os

# --- اطلاعات پنل مرزبان (از محیط ریل‌وی خوانده می‌شود) ---
PANEL_URL = os.getenv("PANEL_URL")
MARZBAN_USER = os.getenv("MARZBAN_USER")
MARZBAN_PASS = os.getenv("MARZBAN_PASS")

# --- آدرس‌های ولت ارز دیجیتال (تثبیت شده برای هندلرز) ---
WALLETS = {
    "usdt_trc20": "TENYb1BrKZ5E2NsbXGg4Yw2z6UcR7q1Fzq",
    "usdt_erc20": "0xcf84d4c26269a714664060d32395778b44548268",
    "trx": "TENYb1BrKZ5E2NsbXGg4Yw2z6UcR7q1Fzq",
    "ton": "EQChSx9FI4Wyu5hK0sREHh0jyuBx_fwJbfulPrujtv8dENct"
}

# آیدی عددی ادمین اصلی
ADMIN_ID = 863961919

# --- لیست پلن‌های V2ray (بر اساس حجم بدون انقضا) ---
# فرمت: (متن دکمه، قیمت عددی به تومان، نام فنی)
V2RAY_PLANS = [
    ("💎 5GB - 100,000 تومان", 100000, "5GB"),
    ("💎 10GB - 150,000 تومان", 150000, "10GB"),
    ("💎 20GB - 200,000 تومان", 200000, "20GB"),
    ("💎 30GB - 250,000 تومان", 250000, "30GB"),
    ("💎 50GB - 350,000 تومان", 350000, "50GB"),
    ("💎 100GB - 500,000 تومان", 500000, "100GB"),
    ("💎 200GB - 900,000 تومان", 900000, "200GB"),
    ("💎 300GB - 1,300,000 تومان", 1300000, "300GB"),
]
# --- لیست پلن‌های BiuBiu (اگر همچنان استفاده می‌کنید) ---
BIUBIU_1U_PLANS = [
    ("👤 1 ماهه - 100,000 تومان", 100000, "B1-1M"),
    ("👤 2 ماهه - 200,000 تومان", 200000, "B1-2M"),
    ("👤 3 ماهه - 300,000 تومان", 300000, "B1-3M"), 
]

BIUBIU_2U_PLANS = [
    ("👥 1 ماهه - 300,000 تومان", 300000, "B2-1M"),
    ("👥 3 ماهه - 600,000 تومان", 600000, "B2-3M"),
    ("👥 6 ماهه - 600,000 تومان", 600000, "B2-6M"),
    ("👥 12 ماهه - 600,000 تومان", 600000, "B2-12M"),
]

# تنظیمات هدیه (اختیاری - برای نمایش در متن‌ها)
CRYPTO_GIFT_PERCENT =5 
