# subscriptions.py

# --- V2Ray ---
v2ray_subs = {
    "5GB": {"name": "5 گیگ - زمان نامحدود", "price": "60,000 تومان"},
    "10GB": {"name": "10 گیگ - زمان نامحدود", "price": "100,000 تومان"},
    "20GB": {"name": "20 گیگ - زمان نامحدود", "price": "150,000 تومان"},
    "30GB": {"name": "30 گیگ - زمان نامحدود", "price": "200,000 تومان"},
    "50GB": {"name": "50 گیگ - زمان نامحدود", "price": "300,000 تومان"},
    "100GB": {"name": "100 گیگ - زمان نامحدود", "price": "400,000 تومان"},
    "200GB": {"name": "200 گیگ - زمان نامحدود", "price": "500,000 تومان"},
}

# --- Biubiu VPN ---
biubiu_subs = {
    "single_user": {
        "1_month": {"name": "1 ماهه", "price": "100,000 تومان"},
        "2_month": {"name": "2 ماهه", "price": "200,000 تومان"},
        "3_month": {"name": "3 ماهه", "price": "300,000 تومان"},
    },
    "two_user": {
        "1_month": {"name": "1 ماهه - حجم نامحدود", "price": "300,000 تومان"},
        "3_month": {"name": "3 ماهه - حجم نامحدود", "price": "500,000 تومان"},
        "6_month": {"name": "6 ماهه - حجم نامحدود", "price": "1,100,000 تومان"},
        "12_month": {"name": "12 ماهه - حجم نامحدود", "price": "1,200,000 تومان"},
    }
}